{"He made his acting debut in the film The Moon is the Sun's Dream (1992), and continued to appear in small and supporting roles throughout the 1990s.": ["He has an acting debut.", "He acted in a film.", "His acting debut was in a film.", "His acting debut was in The Moon is the Sun’s Dream.", "He acted in The Moon is the Sun’s Dream.", "The Moon is the Sun’s Dream is a film.", "The Moon is the Sun’s Dream was released in 1992.", "His acting debut occurred in 1992.", "He appeared in small roles.", "He appeared in supporting roles.", "His small roles occurred throughout the 1990s.", "His supporting roles occurred throughout the 1990s.", "His appearance in small roles occurred after his acting debut.", "His appearance in supporting roles occurred after his acting debut."], "He is also a successful producer and engineer, having worked with a wide variety of artists, including Willie Nelson, Tim McGraw, and Taylor Swift.": ["He is a producer.", "He is successful at being a producer.", "He is an engineer.", "He is successful at being an engineer.", "He has worked with a wide variety of artists.", "Willie Nelson is an artist.", "He has worked with Willie Nelson.", "Tim McGraw is an artist.", "He has worked with Tim McGraw.", "Taylor Swift is an artist.", "He has worked with Taylor Swift."], "In 1963, Collins became one of the third group of astronauts selected by NASA and he served as the back-up Command Module Pilot for the Gemini 7 mission.": ["NASA selected a third group of astronauts.", "Collins belonged to the third group of astronauts.", "Collins was selected by NASA.", "Collins’s selection by NASA occurred in 1963.", "The Gemini 7 mission has a back-up Command Module Pilot.", "Collins’s role in the Gemini 7 mission was as the back-up Command Module Pilot.", "Collins participated in the Gemini 7 mission."], "In addition to his acting roles, Bateman has written and directed two short films and is currently in development on his feature debut.": ["Bateman has acting roles.", "Bateman has written short films.", "The number of short films Bateman has written is two.", "Bateman has directed short films.", "The number of short films Bateman has directed is two.", "Bateman is currently in development on his feature debut.", "The two short films were made before his feature debut.", "His acting roles came before his feature debut."], "Michael Collins (born October 31, 1930) is a retired American astronaut and test pilot who was the Command Module Pilot for the Apollo 11 mission in 1969.": ["Michael Collins was born in October.", "Michael Collins was born on the 31st day of a month.", "Michael Collins was born in 1930.", "Michael Collins is retired.", "Michael Collins is American.", "Michael Collins was an astronaut.", "Michael Collins was a test pilot.", "Michael Collins participated in the Apollo 11 mission.", "Michael Collins’s participation in the Apollo 11 mission occurred in 1969.", "The Apollo 11 mission was active in 1969.", "The day of Michael Collins’s birth occurred before his year of participation in the Apollo 11 mission.", "The Apollo 11 mission had a Command Module Pilot.", "Michael Collins’s role in the Apollo 11 mission was as the Command Module Pilot."], "He was an American composer, conductor, and musical director.": ["He was American.", "He was a composer.", "He was a conductor.", "He was a musical director."], "She currently stars in the romantic comedy series, Love and Destiny, which premiered in 2019.": ["She stars in Love and Destiny.", "Love and Destiny is a series.", "Love and Destiny is a romantic comedy.", "Love and Destiny premiered in 2019."], "His music has been described as a mix of traditional Mexican and Latin American styles, as well as jazz, folk, and rock.": ["He has music.", "His music has been described.", "His music has been described as a mix of styles.", "His music has been described as containing elements of traditional styles of music.", "His music has been described as containing elements of Mexican style of music.", "His music has been described as containing elements of Latin American style of music.", "His music has been described as containing elements of jazz music.", "His music has been described as containing elements of folk music.", "His music has been described as containing elements of rock music."], "He also serves as an ambassador for the charity Leonard Cheshire Disability.": ["He has a role in Leonard Cheshire Disability.", "His role in Leonard Cheshire Disability is as an ambassador.", "Leonard Cheshire Disability is a charity."], "He began his career in Nashville in the late 1950s and has since released numerous albums, including a greatest hits collection in 1999.": ["He has a career.", "His career began in Nashville.", "His career began in the late 1950s.", "He has released albums.", "His released albums are numerous.", "He released a collection.", "His collection contains greatest hits.", "His collection was released in 1999.", "The release of his albums occurred after he began his career."], "He has been performing since the age of 8, when he joined a band in his hometown of Guadalajara and has since gone on to record six studio albums and several singles of his own original material.": ["He has been performing.", "He started performing at the age of 8.", "He joined a band.", "He joined a band at the age of 8.", "His band was in Guadalajara.", "His hometown is Guadalajara.", "He has recorded studio albums.", "The number of studio albums he has recorded is six.", "He has recorded singles.", "He has several singles.", "His studio albums are his own original material.", "His singles are his own original material.", "His recording of studio albums occurred after he joined a band.", "His recording of singles occurred after he joined a band."], "She is also the former President of the Malaysian Chinese Association (MCA) from 2010 to 2013.": ["She had a role in the Malaysian Chinese Association.", "Her role in the Malaysian Chinese Association was as its President.", "Her tenure as President of the Malaysian Chinese Association started in 2010.", "Her tenure as President of the Malaysian Chinese Association ended in 2013.", "MCA is another name for the Malaysian Chinese Association."], "During his professional career, McCoy played for the Broncos, the San Diego Chargers, the Minnesota Vikings, and the Jacksonville Jaguars.": ["McCoy had a professional career.", "McCoy played for the Broncos.", "McCoy played for the San Diego Chargers.", "The Chargers are from San Diego.", "McCoy played for the Minnesota Vikings.", "The Vikings are from Minnesota.", "McCoy played for the Jacksonville Jaguars.", "The Jaguars are from Jacksonville."], "Miller has been described as the architect of Trump's controversial immigration policies, and has previously worked for Alabama Senator Jeff Sessions on immigration issues.": ["Miller has been described.", "Miller has been described as an architect.", "Miller has been described as an architect of Trump’s controversial immigration policies.", "Trump has immigration policies.", "Trump’s immigration policies are controversial.", "Miller worked for Jeff Sessions.", "Jeff Sessions is a Senator.", "Jeff Sessions represents Alabama.", "Miller worked on immigration issues.", "Miller’s work for Jeff Sessions involved immigration issues."], "Her work is often described as whimsical and dreamlike.": ["She has work.", "Her work has been described.", "Her work is described as whimsical.", "Her work is described as dreamlike.", "The description of her work as whimsical has occurred often.", "The description of her work as dreamlike has occurred often."], "He graduated from the United States Military Academy in 1952, and then went on to serve in the United States Air Force.": ["He graduated from the United States Military Academy.", "His graduation from the United States Military Academy occurred in 1952.", "He served in the United States Air Force.", "His service in the United States Air Force occurred after his graduation from the United States Military Academy."], "He is best known for his roles in the films Memories of Murder (2003), The Host (2006), (...) and Parasite (2019).": ["He had a role in Memories of Murder.", "Memories of Murder is a film.", "Memories of Murder was released in 2003.", "He had a role in The Host.", "The Host is a film.", "The Host was released in 2006.", "He had a role in Parasite.", "Parasite is a film.", "Parasite was released in 2009.", "His role in Memories of Murder is one of his best known.", "His role in The Host is one of his best known.", "His role in Parasite is one of his best known."], "Song Kang-ho was born in Gongju, South Korea in 1967.": ["Song Kang-ho was born.", "Song Kang-ho’s birth occurred in Gongju.", "Song Kang-ho’s birth occurred in South Korea.", "Song Kang-ho’s birth occurred in 1967.", "Gongju is in South Korea."], "He studied theater at Chung-Ang University in Seoul.": ["He studied.", "He studied theater.", "He studied at Chung-Ang University.", "His study of theater occurred at Chung-Ang University.", "Chung-Ang University is located in Seoul."], "His breakthrough came with the leading role in the acclaimed crime-drama film Memories of Murder in 2003.": ["He had a breakthrough.", "His breakthrough was based on a leading role.", "His breakthrough was based on his role in Memories of Murder.", "His breakthrough occurred in 2003.", "He had a leading role.", "He had a leading role in Memories of Murder.", "Memories of Murder is a film.", "The genre of Memories of Murder is crime-drama.", "Memories of Murder is acclaimed.", "Memories of Murder was released in 2003."], "This was followed by the monster movie The Host in 2006, which became the highest-grossing film in Korean history at the time.": ["This was followed by The Host.", "The Host is a movie.", "The Host was released in 2006.", "The genre of The Host is monster movie.", "The Host became the highest-grossing film in Korean history."]}